///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Устанавливает сегмент партнеров Сегмент в качестве рабочего для текущего пользователя.
// 
// Параметры:
//  Сегмент - СправочникСсылка._ДемоСегментыПартнеровРасширение - сегмент, который нужно установить в качестве основного.
//
Процедура УстановитьОсновнойСегмент(Сегмент) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("Справочники._ДемоСегментыПартнеровРасширение.УстановитьОсновнойПроект", "Сегмент", 
		Сегмент, Тип("СправочникСсылка._ДемоСегментыПартнеровРасширение"));
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("_ДемоРабочийСегментПартнераРасширение", "РабочийСегментПартнера", Сегмент);
	ПараметрыСеанса._ДемоРабочийСегментПартнераРасширение = Сегмент;
	
КонецПроцедуры

// Возвращает рабочий сегмент партнеров для текущего пользователя.
//
// Возвращаемое значение:
//   СправочникСсылка._ДемоСегментыПартнеровРасширение - рабочий сегмент партнеров или пустая ссылка, если основной проект не задан.
//
Функция РабочийСегментПартнера() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("_ДемоРабочийСегментПартнераРасширение", "РабочийСегментПартнера", ПустаяСсылка());
	
КонецФункции

// Параметры:
//  ИмяПараметра - Строка
//  УстановленныеПараметры - Массив из Строка
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "_ДемоРабочийСегментПартнераРасширение" Тогда
		ПараметрыСеанса._ДемоРабочийСегментПартнераРасширение = РабочийСегментПартнера();
		УстановленныеПараметры.Добавить("_ДемоРабочийСегментПартнераРасширение");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
