///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

&После("ОбработчикКоманды")
Процедура _ДемоРасширениеОбработчикКоманды(ФормаОтчета, Команда, Результат)
	
	Если ФормаОтчета.НастройкиОтчета.ПолноеИмя = "Отчет._ДемоОстаткиТоваровРасширение"
	   И Команда.Имя = "_ДемоКоманда" Тогда
		
		ТабличныйДокумент = ФормаОтчета.ОтчетТабличныйДокумент;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Редактирование таблицы сформированного отчета ""%1""'"),
			ФормаОтчета.Заголовок);
		
		ПараметрыФормы = СтандартныеПодсистемыКлиент.ПараметрыРедактораТабличногоДокумента();
		ПараметрыФормы.ИмяДокумента = Заголовок;
		ПараметрыФормы.Редактирование = Истина;
		
		СтандартныеПодсистемыКлиент.ПоказатьРедакторТабличногоДокумента(ТабличныйДокумент, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
